In [2]:
import sqlite3
import pandas as pd

In [3]:
con = sqlite3.connect(":memory:")
cur = con.cursor()

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [4]:
link = 'https://raw.githubusercontent.com/eric-bunch/boston_housing/master/boston.csv'

In [5]:
data = pd.read_csv(link)
data.rename(columns = {'MDEV':'MEDV'}, inplace=True)

In [6]:
data.to_sql("boston", con, index=False, if_exists="replace")

In [7]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 100
    """,
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,0.12204,0.0,2.89,0.0,0.445,6.625,57.8,3.4952,2.0,276.0,18.0,357.98,6.65,28.4
96,0.11504,0.0,2.89,0.0,0.445,6.163,69.6,3.4952,2.0,276.0,18.0,391.83,11.34,21.4
97,0.12083,0.0,2.89,0.0,0.445,8.069,76.0,3.4952,2.0,276.0,18.0,396.90,4.21,38.7
98,0.08187,0.0,2.89,0.0,0.445,7.820,36.9,3.4952,2.0,276.0,18.0,393.53,3.57,43.8
99,0.06860,0.0,2.89,0.0,0.445,7.416,62.5,3.4952,2.0,276.0,18.0,396.90,6.19,33.2

In [8]:
pd.read_sql(
    """
    SELECT * FROM boston
    limit 5
    """,
    con,
).head

<bound method NDFrame.head of       CRIM    ZN  INDUS  CHAS    NOX     RM   AGE     DIS  RAD    TAX  \
0  0.00632  18.0   2.31   0.0  0.538  6.575  65.2  4.0900  1.0  296.0
1  0.02731   0.0   7.07   0.0  0.469  6.421  78.9  4.9671  2.0  242.0
2  0.02729   0.0   7.07   0.0  0.469  7.185  61.1  4.9671  2.0  242.0
3  0.03237   0.0   2.18   0.0  0.458  6.998  45.8  6.0622  3.0  222.0
4  0.06905   0.0   2.18   0.0  0.458  7.147  54.2  6.0622  3.0  222.0

   PTRATIO       B  LSTAT  MEDV
0     15.3  396.90   4.98  24.0
1     17.8  396.90   9.14  21.6
2     17.8  392.83   4.03  34.7
3     18.7  394.63   2.94  33.4
4     18.7  396.90   5.33  36.2  >

1. Выведите количество пустых значений по каждой из колонок (название колонки, кол-во пустых значений)

In [9]:
pd.read_sql(
    """
    SELECT count(CRIM), count(ZN), count(INDUS), count(CHAS), count(NOX), count(RM), count(AGE), count(DIS), count(RAD), count(TAX), count(PTRATIO), count(B), count(LSTAT), count(MEDV) FROM boston
    where CRIM is null or ZN is null or INDUS is null or CHAS is null or NOX is null or RM is null or AGE is null or DIS is null or RAD is null or TAX is null or PTRATIO is null or B is null or LSTAT is null or MEDV is null
    limit 5
    """,
    con,
)

,count(CRIM),count(ZN),count(INDUS),count(CHAS),count(NOX),count(RM),count(AGE),count(DIS),count(RAD),count(TAX),count(PTRATIO),count(B),count(LSTAT),count(MEDV)
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0

2. Выведите количество уникальных значений по каждой из колонок (название колонки, кол-во уникальных значений)

In [10]:
pd.read_sql(
    """
    SELECT count(distinct CRIM), count(distinct ZN), count(distinct INDUS), count(distinct CHAS), count(distinct NOX), count(distinct RM), count(distinct AGE), count(distinct DIS), count(distinct RAD), count(distinct TAX), count(distinct PTRATIO), count(distinct B), count(distinct LSTAT), count(distinct MEDV) FROM boston
    limit 5
    """,
    con,
)

,count(distinct CRIM),count(distinct ZN),count(distinct INDUS),count(distinct CHAS),count(distinct NOX),count(distinct RM),count(distinct AGE),count(distinct DIS),count(distinct RAD),count(distinct TAX),count(distinct PTRATIO),count(distinct B),count(distinct LSTAT),count(distinct MEDV)
0,504,26,76,2,81,446,356,412,9,66,46,357,455,229

3. Выведите колонки, у которых медиана равна минимальному значению (название колонки).
Напишите какой вывод можно сделать по данным в этих колонках

In [11]:
pd.read_sql(
    """
    with min_med as (
    SELECT
    min(CRIM) as min_crim,
    (SELECT CRIM as m_crim FROM boston ORDER BY CRIM LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_crim,
    min(ZN) as min_zn,
    (SELECT ZN as m_crim FROM boston ORDER BY ZN LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_zn,
    min(INDUS) as min_indus,
    (SELECT INDUS as m_crim FROM boston ORDER BY INDUS LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_indus,
    min(CHAS) as min_chas,
    (SELECT CHAS as m_crim FROM boston ORDER BY CHAS LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_chas,
    min(NOX) as min_nox,
    (SELECT NOX as m_crim FROM boston ORDER BY NOX LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_nox,
    min(RM) as min_rm,
    (SELECT RM as m_crim FROM boston ORDER BY RM LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_rm,
    min(AGE) as min_age,
    (SELECT AGE as m_crim FROM boston ORDER BY AGE LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_age,
    min(DIS) as min_dis,
    (SELECT DIS as m_crim FROM boston ORDER BY DIS LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_dis,
    min(RAD) as min_rad,
    (SELECT RAD as m_crim FROM boston ORDER BY RAD LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_rad,
    min(TAX) as min_tax,
    (SELECT TAX as m_crim FROM boston ORDER BY TAX LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_tax,
    min(PTRATIO) as min_ptratio,
    (SELECT PTRATIO as m_crim FROM boston ORDER BY PTRATIO LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_ptratio,
    min(B) as min_b,
    (SELECT B as m_crim FROM boston ORDER BY B LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_b,
    min(LSTAT) as min_lstat,
    (SELECT LSTAT as m_crim FROM boston ORDER BY LSTAT LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_lstat,
    min(MEDV) as min_medv,
    (SELECT MEDV as m_crim FROM boston ORDER BY MEDV LIMIT 1 OFFSET (SELECT COUNT(*) FROM boston) / 2) as med_medv
    from boston
        limit 5)
    select min_zn, med_zn, min_chas, med_chas from min_med

    """,
    con,
)

   min_zn  med_zn  min_chas  med_chas
0     0.0     0.0       0.0       0.0

4. Выведите разницу между среднем количеством комнат(RM) в домах с самой дорогой стоимостью(MEDV) и 25 самыми дешевыми домами. 
Аналогично по 50, 100, 200, 300 самыми дешевыми домами. (кол-во домов(25,50,100,200,300), среднее кол-во комнат в них, среднее кол-во комнат в самых дорогих, разница).
Напишите влияет ли кол-во комнат на стоимость и как сильно.

In [77]:
pd.read_sql(
    """
   with
   lim25 as(
   select count(*) as cnt_house, avg(rm) as rvmin, (select rm from boston order by medv desc limit 1) as rvmax
   from (select * from boston limit 25) as a),

   lim50 as(
   select count(*) as cnt_house, avg(rm) as rvmin, (select rm from boston order by medv desc limit 1) as rvmax
   from (select * from boston limit 50) as a),

   lim100 as(
   select count(*) as cnt_house, avg(rm) as rvmin, (select rm from boston order by medv desc limit 1) as rvmax
   from (select * from boston limit 100) as a),

   lim200 as(
   select count(*) as cnt_house, avg(rm) as rvmin, (select rm from boston order by medv desc limit 1) as rvmax
   from (select * from boston limit 200) as a),

   lim300 as(
   select count(*) as cnt_house, avg(rm) as rvmin, (select rm from boston order by medv desc limit 1) as rvmax
   from (select * from boston limit 300) as a),

   limunion as (
   select * from lim25
   union all
   select * from lim50
   union all
   select * from lim100
   union all
   select * from lim200
   union all
   select * from lim300
   )

    select cnt_house, rvmin, rvmax, (rvmax - rvmin) as rvrazn from limunion


    """,
    con,
)
# исходя из полученных результатов можно сделать вывод, что с учетом среднего количества комнат в домах увеличивается их стоимость. По мере удорожания стоимости квартиры аналогичным образом увеличивается среднее количество комнат, т.к. если начинать от минимума, то разница в комнатах составляет 1,3 комнаты, а увеличивая стоимость, разница в количестве комнат уже составляет примерно 1. Если пойти дальше, то со временем данные сравняются

   cnt_house     rvmin  rvmax    rvrazn
0         25  6.130040  7.489  1.358960
1         50  6.086760  7.489  1.402240
2        100  6.234410  7.489  1.254590
3        200  6.252390  7.489  1.236610
4        300  6.420333  7.489  1.068667

5. Выведите ранги значений колонки LSTAT(процент населения с более низким статусом) в домах с самой дорогой стоимостью (значение LSTAT, стоимость, ранг). Напишите какой вывод можно сделать по этим данным.

In [13]:
pd.read_sql(
    """
    SELECT lstat,
    medv,
    rank() OVER (PARTITION BY medv ORDER BY lstat) rank_by_dept
    FROM boston
    order by medv desc

    """,
    con,
)
#Исходя из результатов можно сделать вывод, что чем большее количество населения с низким статусом проживает в более дорогих домах, тем их ранг в выборке ниже

     LSTAT  MEDV  rank_by_dept
0     1.73  50.0             1
1     1.92  50.0             2
2     2.88  50.0             3
3     2.96  50.0             4
4     2.97  50.0             5
..     ...   ...           ...
501  36.98   7.0             2
502  29.97   6.3             1
503  26.77   5.6             1
504  22.98   5.0             1
505  30.59   5.0             2

[506 rows x 3 columns]

6. Выведите среднюю стоимость домов граничащих с рекой(CHAS) и нет (граничит/не граничит, стоимость)

In [14]:
pd.read_sql(
    """
    SELECT avg(medv) as house_cost, case chas when '1.0' then 'Граничит' else 'Не граничит' end as border_river FROM boston
    group by chas
    limit 50
    """,
    con,
)

   house_cost border_river
0   22.093843  Не граничит
1   28.440000     Граничит

7. Выведите все колонки, у которых среднее значение выше, когда дом граничит с рекой (название колонки). Напишите какой вывод можно сделать по этим данным.

In [16]:
pd.read_sql(
    """
    with average as (
       SELECT
    avg(CRIM) as avg_crim,
    (select avg(crim) from boston where chas = 1.0) as river_crim,
    avg(ZN) as avg_zn,
    (select avg(ZN) from boston where chas = 1.0) as river_zn,
    avg(INDUS) as avg_indus,
    (select avg(INDUS) from boston where chas = 1.0) as river_indus,
    avg(CHAS) as avg_chas,
    (select avg(CHAS) from boston where chas = 1.0) as river_chas,
    avg(NOX) as avg_nox,
    (select avg(NOX) from boston where chas = 1.0) as river_nox,
    avg(RM) as avg_rm,
    (select avg(RM) from boston where chas = 1.0) as river_rm,
    avg(AGE) as avg_age,
    (select avg(AGE) from boston where chas = 1.0) as river_age,
    avg(DIS) as avg_dis,
    (select avg(DIS) from boston where chas = 1.0) as river_dis,
    avg(RAD) as avg_rad,
    (select avg(RAD) from boston where chas = 1.0) as river_rad,
    avg(TAX) as avg_tax,
    (select avg(TAX) from boston where chas = 1.0) as river_tax,
    avg(PTRATIO) as avg_ptratio,
    (select avg(PTRATIO) from boston where chas = 1.0) as river_ptratio,
    avg(B) as avg_b,
    (select avg(B) from boston where chas = 1.0) as river_b,
    avg(LSTAT) as avg_lstat,
    (select avg(LSTAT) from boston where chas = 1.0) as river_lstat,
    avg(MEDV) as avg_medv,
    (select avg(MEDV) from boston where chas = 1.0) as river_medv
    from boston)


    select
    (avg_crim - river_crim) as avg_crim,
    (avg_zn - river_zn) as avg_zn,
    (avg_dis - river_dis) as avg_dis,
    (avg_rad - river_rad) as avg_rad,
    (avg_tax - river_tax) as avg_tax,
    (avg_ptratio - river_ptratio) as avg_ptratio,
    (avg_lstat - river_lstat) as avg_lstat
    from average

    """,
    con,
)
#В домах, находящихся возле реки средне количество преступности на душу населения больше обычного на 1.74209
#В домах, находящихся возле реки средняя доля земель под жилую застройку зонирована под участки площадью более 25 000 кв. футов больше обычного на 3.649351
#В домах, находящихся возле реки средние взвешенные расстояния до пяти центров занятости Бостона больше обычного на 0.765334
#В домах, находящихся возле реки средний индекс доступности к радиальным магистралям больше обычного на 0.235121
#В домах, находящихся возле реки средняя полная ставка налога на имущество за 10 000 долларов США больше обычного на 21.980011
#В домах, находящихся возле реки среднее соотношение учеников и учителей по городам больше обычного на 0.964105
#В домах, находящихся возле реки средний % более низкого статуса населения больше обычного на 1.411349

#Ввиду того, что самым выделяющимся параметром является TAX - полная ставка налога на имущество за 10 000 долларов США - можно предположить, что в США
#на дома, который находятся около реки распространяется более высокая налоговая ставка. Также параметр ZN говрит о том, что более большие площади для строительства
#могут позволить себе более богатые люди, но при этом из-за высокого налога они становятся более бедными. Количество чернокожих людей в этих районах ниже среднего

   avg_crim    avg_zn   avg_dis   avg_rad    avg_tax  avg_ptratio  avg_lstat
0   1.74209  3.649351  0.765334  0.235121  21.980011     0.964105   1.411349

8. Выведите значения долей промышленной застройки(INDUS), концентрации оксидов азота(NOX) и по их перцентилям - 10, 20 ... 100 ( перцетиль(10,20...100),значение INDUS, значение NOX). Напишите прослеживается между ними взаимосвязь

In [88]:
pd.read_sql(
    """
   with prc as (
   SELECT INDUS, NOX, NTILE(10) OVER(ORDER BY INDUS) as percen FROM boston
   )
   select percen * 10 as percentile, INDUS, NOX from prc group by percentile

    """,
    con,
)
#Исходя из полученных результатов можно сделать вывод о том, что с увеличением количества промышленной застройки относительно пропорционально увеличивается и количество концентрации оксидов азота

   percentile  INDUS    NOX
0          10   0.46  0.422
1          20   2.93  0.401
2          30   4.39  0.442
3          40   5.96  0.499
4          50   7.38  0.493
5          60   9.69  0.585
6          70  13.89  0.550
7          80  18.10  0.693
8          90  18.10  0.740
9         100  19.58  0.871

CRIM - уровень преступности на душу населения
ZN - доля земель под жилую застройку зонирована под участки площадью более 25 000 кв. футов.
INDUS - доля акров неторгового бизнеса на город.
CHAS - 1, если граничит с рекой, 0 иначе
NOX - концентрация оксидов азота (частей на 10 миллионов)
RM - среднее количество комнат в квартире
AGE - доля жилых домов, построенных до 1940 г.
DIS - взвешенные расстояния до пяти центров занятости Бостона
RAD - индекс доступности к радиальным магистралям
TAX - полная ставка налога на имущество за 10 000 долларов США
PTRATIO - соотношение учеников и учителей по городам
B - 1000(Bk - 0.63)^2, где Bk доля чернокожих людей по городам
LSTAT - % более низкого статуса населения
MEDV - Средняя стоимость домов в 1000 долларов.